"""
Дан лист x:

x = [1, 2, 3, 4, 5]
x[<...>] = [-1, -3, -5]

print(x)

Напишите слайс вместо <...>, чтобы результатом стал лист:

[-5, 2, -3, 4, -1]


"""

x[-1:-len(x)-1:-2] = [-1, -3, -5]




